-- 
-- โครงสร้างตาราง `bs_book`
-- 

CREATE TABLE `bs_book` (
  `b_id` int(5) NOT NULL auto_increment,
  `c_id` int(4) NOT NULL,
  `b_title` varchar(80) NOT NULL,
  `b_detail` text NOT NULL,
  `b_author` varchar(80) NOT NULL,
  `b_publisher` varchar(80) NOT NULL,
  `b_price` int(6) NOT NULL,
  `b_image` varchar(50) NOT NULL,
  PRIMARY KEY  (`b_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 AUTO_INCREMENT=10008 ;

-- 
-- dump ตาราง `bs_book`
-- 

INSERT INTO `bs_book` VALUES (10001, 1, 'Microsoft Office Excel 2007', 'เป็นคู่มือโปรแกรม Microsoft Office Excel 2007 ฉบับสมบูรณ์ สุดยอดโปรแกรมคำนวณ พิมพ์ 2 สีสลับกับ 4 สี พร้อมแผ่น CD', 'ภาษิต เครืองเนียม', 'สำนักพิมพ์อินโฟเพรส', 199, '10001.jpg');
INSERT INTO `bs_book` VALUES (10002, 1, 'ช่างคอมมืออาชีพ', 'เป็นหนังสือติดตั้งและแก้ปัญหา ฉบับช่างคอมมืออาชีพ 2008 รวบรวมเทคนิคเด็ด ๆ ไว้มากมาย', 'สุทธิพันธุ์ แสนละเอียด', 'บริษัท ไอดีซีฯ จำกัด', 240, '10002.jpg');
INSERT INTO `bs_book` VALUES (10003, 1, 'Advance .NET', 'คู่มือ Advance .NET Programming ฉบับมืออาชีพ เจาะลึกตีแผ่ทุกความสามารถ ของ .NET Framework 2.0 โดยประสบการณ์ตรงของโปรแกรมเมอร์มืออาชีพที่คลุกวงในมานานเกือบ 10 ปี', 'ศุภชัย สมพานิช', 'สำนักพิมพ์อินโฟเพลส', 375, '10003.jpg');
INSERT INTO `bs_book` VALUES (10004, 1, 'สร้างงานเอกสารด้วย Open Office', 'สร้างงานเอกสารสารพัดในสำนักงาน ใช้ได้กับ Windows XP และ Vista รวมสุดยอดโปรแกรมสำนักงานที่ควรมีติดตั้งไว้ในเครื่อง  พบกับรายละเอียดเนื้อหาข้างเล่ม เช่น การใช้งาน Open Office , สร้างคู่มือ / เอกสาร / รายงาน เป็นต้น', 'ซิป้า (SIPA)', 'สำนักพิมพ์ มมส.', 200, '10004.jpg');
INSERT INTO `bs_book` VALUES (10005, 2, 'แผนที่และคู่มือเที่ยวไทย 2551', 'นำเสนอแผนที่สำหรับเดินทางท่องเที่ยวในประเทศไทยอย่างละเอียด ทั้ง 76 จังหวัด 142 อำเภอ ด้วยข้อมูลสำรวจใหม่ล่าสุดจากระบบดาวเทียม GPS', 'รักไทย ใจตะวัน', 'se-ed', 290, '10005.gif');
INSERT INTO `bs_book` VALUES (10006, 2, 'สวัสดี สวีเดน', 'หนังสือเล่มนี้จะพาคุณไปรู้จักกับสวีเดนอย่างถึงแก่นเลยทีเดียว ด้วยข้อมูลทางด้านภูมิประเทศ วัฒนธรรมอันหลากหลาย สถานที่ท่องเที่ยวที่สำคัญและมีความงดงาม', 'ชำนาญ บุญญาพุทธิพงศ์', 'สำนักพิมพ์ไผ่งาม', 150, '10006.gif');
INSERT INTO `bs_book` VALUES (10007, 2, 'สวิตเซอร์แลนด์', 'หนังสือเล่มนี้จะพาคุณร่วมเดินทางสัมผัสกับดินแดนในฝัน ที่ที่มีธรรมชาติงดงาม ทะเลสาบที่ใสราวกับกระจก ทุ่งหญ้าเขียวขจี ภูเขาสวยด้วยดอกหญ้าที่ขึ้นปกคลุมและแสงสะท้อนของดวงอาทิตย์ที่ต้องหิมะเป็นประกาย เนื้อหาชวนติดตามทั้งเล่ม', 'ภัทรียา ทองฉิม', 'สำนักพิมพ์ยูเคเค', 180, '10007.gif');

-- --------------------------------------------------------

-- 
-- โครงสร้างตาราง `bs_category`
-- 

CREATE TABLE `bs_category` (
  `c_id` int(4) NOT NULL auto_increment,
  `c_name` varchar(100) NOT NULL,
  PRIMARY KEY  (`c_id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=3 ;

-- 
-- dump ตาราง `bs_category`
-- 

INSERT INTO `bs_category` VALUES (1, 'คอมพิวเตอร์');
INSERT INTO `bs_category` VALUES (2, 'ท่องเที่ยว');
